Catalogs/АР_Счетчики2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_Счетчики2</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаркаСчетчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ВидыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаЭкслуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеРесурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_НазваниеРесурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_Счетчики2/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаписатьФайл(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение; 
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.ПолноеИмяФайла = ""; 
	Фильтр = "Файл Excel (*,xls)|*.xls"; 
	ДиалогОткрытияФайла.Фильтр = Фильтр; 
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь; 
	ДиалогОткрытияФайла.Заголовок = "Выберите файл для сохранения бланка"; 
	
	ПутьКФайлу = НазваниеРесурса + "_" + ИК + "_" + Формат(Дата,"ДЛФ=Д");
	ДиалогОткрытияФайла.ПолноеИмяФайла = ПутьКФайлу;
	Если ДиалогОткрытияФайла.Выбрать() Тогда 
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла; 
	//Иначе
	//	ПутьКФайлу="";
	КонецЕсли;

	АдресВХранилище = "";
	
	ЗаписатьФайлСервер(ПутьКФайлу,НазваниеРесурса,АдресВХранилище);

	
	
КонецПроцедуры

Процедура ЗаписатьФайлСервер(ПутьКФайлу,НазваниеРесурса,АдресВХранилище)
	
	Попытка 
		Макет = Справочники.АР_Счетчики2.ПолучитьМакет(НазваниеРесурса);
		MSExcel = Макет.Получить();
		Книга = MSExcel.Application.Workbooks(1); 
		Лист1 = Книга.WorkSheets(1); 
		//Лист1.Cells.Clear(); //ClearContents();
	Исключение 
		Сообщить(ОписаниеОшибки()); 
		MSExcel.Application.Quit(); 
		Сообщить ("Ошибка при инициализаци xls");
	КонецПопытки; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_Счетчики2.НомерСчетчика
	               |ИЗ
	               |	Справочник.АР_Счетчики2 КАК АР_Счетчики2
	               |ГДЕ
	               |	АР_Счетчики2.ИК = &ИК";
	Запрос.УстановитьПараметр("ИК",ИК);
	Если НазваниеРесурса = "Электричество" Тогда
		НомерСтроки = 9;
		Лист1.Cells(4, 2).Value = ЭтотОбъект.Период;
	ИначеЕсли НазваниеРесурса = "ХВ_ГВ" Тогда
		НомерСтроки = 11;
		Лист1.Cells(3, 2).Value = ЭтотОбъект.Период;
	ИначеЕсли НазваниеРесурса = "Тепло" Тогда
		НомерСтроки = 10;
		Лист1.Cells(3, 2).Value = ЭтотОбъект.Период;
	КонецЕсли;
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НомерСтроки = НомерСтроки+1;
		Лист1.Rows(НомерСтроки).Insert();
		Лист1.Cells(НомерСтроки, 2).NumberFormat = "@";
		Лист1.Cells(НомерСтроки, 2).Value = Выборка.НомерСчетчика;
	КонецЦикла;	
	
	//+документ
	Док = Документы.АР_ФормыВводаКоммунальныхУслуг.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Записать();
	//-документ
	
	Лист1.Cells(1, 3).Value = НазваниеРесурса + "_" + ИК + "_" + Формат(Дата,"ДЛФ=Д") + "_" + Док.Номер;
	
	Попытка 
		MSExcel.Application.ScreenUpdating 	= Истина;
		//MSExcel.Application.EnableEvents	= Истина;
		MSExcel.Application.Visible         = Истина;
		MSExcel.Windows(1).Visible  = Истина;
		MSExcel.Worksheets(1).Visible  = Истина;
		MSExcel.Activate(); 
		Книга.SaveAs(ПутьКФайлу);
	Исключение
		Сообщить(ОписаниеОшибки()+" Файл не сохранен!");
	КонецПопытки; 
	
	//+документ
	ИмяФайлаИсточника = ПутьКФайлу;
	Поз = Найти(ИмяФайлаИсточника, "\");
	Пока Поз <> 0 Цикл
		ИмяФайлаИсточника = Сред(ИмяФайлаИсточника, Поз+1);
		Поз = Найти(ИмяФайлаИсточника, "\");
	КонецЦикла;
	Файл = Новый Файл(ПутьКФайлу);
	Если Файл.Существует() Тогда
		ПутьДоПланировок = "\\SERVER-STR\obmen\1\Forms\"+ИмяФайлаИсточника;
		КопироватьФайл(ПутьКФайлу,ПутьДоПланировок);
	КонецЕсли;
	//
	//Если ПоместитьФайл(АдресВХранилище, , ПутьДоПланировок, , УникальныйИдентификатор) Тогда
	//	ФайлДок = Новый Файл(ПутьДоПланировок);
	//	Имя = Файл.Имя;
	//	СсылкаНаФайлВоВременномХранилище = АдресВХранилище;
	//	//Объект.Наименование = Файл.Имя;
	//	//Объект.ИмяФайла = Имя;
	//КонецЕсли;
	//
	
	//ХЗ=Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВХранилище));
	Док.Файл = ПутьДоПланировок;
	Док.Записать();
	//-документ
	
КонецПроцедуры	

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПериодНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, 
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
		
	Текст = Период;
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), Период, НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Форма, Элемент, СтандартнаяОбработка, ВидПериода, Период, НачалоПериода, КонецПериода) Экспорт
	
	Если НачалоПериода = '00010101' Тогда
		НачалоПериода = ВыборПериодаКлиентСервер.НачалоПериодаОтчета(ВидПериода, ТекущаяДата());
	КонецЕсли;
	
	ВыбранныйПериод      = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода);
	СтандартнаяОбработка = Ложь;
	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранныйПериод.Представление;
	
	НачалоПериода = ВыбранныйПериод.Значение;
	КонецПериода  = ВыборПериодаКлиентСервер.КонецПериодаОтчета(ВидПериода, ВыбранныйПериод.Значение);

КонецПроцедуры

&НаКлиенте
Функция ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, НачалоПериода)
	
	Список = ВыборПериодаКлиентСервер.ПолучитьСписокПериодов(НачалоПериода, ВидПериода);
	Если Список.Количество() = 0 Тогда
		СтандартнаяОбработка = Ложь;
		Возврат Неопределено;
	КонецЕсли;
	
	ЭлементСписка = Список.НайтиПоЗначению(НачалоПериода);
	ВыбранныйПериод = Форма.ВыбратьИзСписка(Список, Элемент, ЭлементСписка);
	
	Если ВыбранныйПериод = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Индекс = Список.Индекс(ВыбранныйПериод);
	Если Индекс = 0 ИЛИ Индекс = Список.Количество() - 1 тогда
		ВыбранныйПериод = ВыбратьПериодОтчета(Форма, Элемент, СтандартнаяОбработка, ВидПериода, ВыбранныйПериод.Значение);
	КонецЕсли;
	
	Возврат ВыбранныйПериод;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтотОбъект.Дата = ТекущаяДата();
	ЭтотОбъект.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Месяц"), НачалоМесяца(ЭтотОбъект.Дата), КонецМесяца(ЭтотОбъект.Дата));
КонецПроцедуры
